Revit 2026 API

# PathReinforcementGetCurveElementIds Method

---

Retrieves the set of ElementIds of curves forming the boundary of the Path Reinforcement.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetCurveElementIds()
```
```vb
Public Function GetCurveElementIds As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetCurveElementIds()
```
```fsharp
member GetCurveElementIds : unit -> IList<ElementId>
```

#### Return Value

IListElementId A collection of ElementIds of ModelCurve elements.

Each ElementId in the collection is an Id of an Element of type ModelCurve.

#### Reference

PathReinforcement Class

Autodesk.Revit.DB.Structure Namespace